In [1]:
import pymssql
import pandas as pd

### Lendo os dados das Tabelas

In [2]:
conn = pymssql.connect(server='192.168.65.141', user='ResidenciaIA', password='Hub_Sicoob@2021', database='DataStage')

In [3]:
cursor = conn.cursor(as_dict=True)

In [20]:
cursor.execute('SELECT * from tce.clientefisica')
data = cursor.fetchall()

In [21]:
df=pd.DataFrame(data)

In [22]:
df.head()

,IDCLIENTE,IDINSTITUICAO,IDUNIDADEINST,CODTIPOPROFISSAO,CODESTADOCIVIL,CODREGIMECASAMENTO,CODTIPOSEXO,CODTIPOEXPOSICAO,CODVINCULOEMPREGATICIO,CODNIVELEDUCACIONAL,...,DESCORGAOEXPRG,IDUFORGEXPRG,DATAEMISSAORG,CODPROFISSAOCONJUGE,BOLMANTEMVINCULOESTAVEL,NUMDEPENDENTES,BOLPESSOAEXPOSTA,NUMCHECKALTERACAO,DATAHORACARGA,BOLFALECIDO
0,68,676,0,902.0,NaN,NaN,0,None,4.0,7.0,...,SSP,18,2000-03-17,None,0,0,0,6c6d02be915e63dd25a52320964551a9,2019-12-05 23:14:52,None
1,191,676,0,2230.0,2.0,2.0,1,None,3.0,9.0,...,CRM,7,2018-09-11,None,1,0,0,5d7cec89f0304f5e855553dd85b2baf2,2020-12-22 21:06:48,None
2,192,676,0,10036.0,NaN,NaN,0,None,1.0,7.0,...,SSP,18,1992-08-12,None,0,0,0,feaa5c3f4da484703bf517208c95b8b3,2019-12-05 23:14:52,None
3,571,676,0,NaN,NaN,NaN,1,None,NaN,NaN,...,SSP,18,1995-10-06,None,0,0,0,ce79d37e79e41d129a731038c880e5fe,2019-12-05 23:14:52,None
4,619,676,0,2975.0,2.0,1.0,0,None,1.0,7.0,...,SESP,24,2000-03-23,None,1,0,0,3ec125ea9cb20db6274ce59a2521d695,2021-04-07 21:17:19,None

In [23]:
list(df.columns.values)

['IDCLIENTE',
 'IDINSTITUICAO',
 'IDUNIDADEINST',
 'CODTIPOPROFISSAO',
 'CODESTADOCIVIL',
 'CODREGIMECASAMENTO',
 'CODTIPOSEXO',
 'CODTIPOEXPOSICAO',
 'CODVINCULOEMPREGATICIO',
 'CODNIVELEDUCACIONAL',
 'DATANASCIMENTO',
 'DESCNATURALIDADE',
 'DESCNACIONALIDADE',
 'DESCORGAOEXPRG',
 'IDUFORGEXPRG',
 'DATAEMISSAORG',
 'CODPROFISSAOCONJUGE',
 'BOLMANTEMVINCULOESTAVEL',
 'NUMDEPENDENTES',
 'BOLPESSOAEXPOSTA',
 'NUMCHECKALTERACAO',
 'DATAHORACARGA',
 'BOLFALECIDO']

In [24]:
cursor.execute('SELECT * from tce.tiposexo')
data_tipo_sexo = cursor.fetchall()

In [25]:
df_sexo = pd.DataFrame(data_tipo_sexo)
df_sexo

   CODTIPOSEXO   DESCTIPOSEXO
0            0       FEMININO
1            1      MASCULINO
2            2  NÃƒO INFORMADO

In [26]:
cursor.execute('SELECT * from tce.RegimeCasamento')
data_tipo_casamento = cursor.fetchall()

In [27]:
df_tipo_casamento = pd.DataFrame(data_tipo_casamento)
df_tipo_casamento

   CODREGIMECASAMENTO           DESCREGIMECASAMENTO
0                   1            COMUNHÃƒO UNIVERSAL
1                   2              COMUNHÃƒO PARCIAL
2                   3             SEPARAÃ‡ÃƒO DE BENS
3                   4   SEPARAÃ‡ÃƒO OBRIGATÃ“RIA DE BE
4                   5  PARTICIPAÃ‡ÃƒO FINAL NOS AQUES

### Retorne quantos clientes sÃ£o homens e quantos sÃ£o mulheres

In [31]:
cursor = conn.cursor()
cursor.execute('SELECT T.DescTipoSexo, COUNT(C.CodTipoSexo) FROM tce.clientefisica C'
                ' INNER JOIN tce.tiposexo T on T.CodTipoSexo = C.CodTipoSexo'
                ' GROUP BY T.DescTipoSexo;')
data2 = cursor.fetchall()
df_tipo_sexo = pd.DataFrame(data2)
df_tipo_sexo

               0       1
0       FEMININO  165678
1      MASCULINO  194357
2  NÃƒO INFORMADO    1874

### Relacione os tipos de regime de casamento, quantos registros tem para cada tipo

In [29]:
cursor = conn.cursor()
cursor.execute('SELECT R.DescRegimeCasamento, COUNT(C.CodRegimeCasamento) FROM tce.clientefisica C' 
                ' INNER JOIN tce.RegimeCasamento R on C.CodRegimeCasamento = R.CodRegimeCasamento'
                ' GROUP BY R.DescRegimeCasamento;')
data3 = cursor.fetchall()
df_reg_casamento = pd.DataFrame(data3)
df_reg_casamento

                              0       1
0              COMUNHÃƒO PARCIAL  122332
1            COMUNHÃƒO UNIVERSAL   24844
2  PARTICIPAÃ‡ÃƒO FINAL NOS AQUES     122
3             SEPARAÃ‡ÃƒO DE BENS    6826
4   SEPARAÃ‡ÃƒO OBRIGATÃ“RIA DE BE    1417

In [31]:
cursor.close()